## Plan Result (sbox-genesis)




<pre><code>Plan: 0 to add, 2 to change, 0 to destroy.</code></pre>

* Update
  * module.genesis.azurerm_key_vault.key_vault
  * module.genesis.azurerm_key_vault_access_policy.developers_group_access_policy




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.genesis.data.null_data_source.key_vault_outputs will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "null_data_source" "key_vault_outputs" {
      + has_computed_default = (known after apply)
      + id                   = (known after apply)
      + inputs               = {
          + "azurerm_key_vault_id" = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/genesis-rg/providers/Microsoft.KeyVault/vaults/dcdcftappssboxkv"
        }
      + outputs              = (known after apply)
      + random               = (known after apply)
    }

  # module.genesis.azurerm_key_vault.key_vault will be updated in-place
  ~ resource "azurerm_key_vault" "key_vault" {
        id                              = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/genesis-rg/providers/Microsoft.KeyVault/vaults/dcdcftappssboxkv"
        name                            = "dcdcftappssboxkv"
      ~ tags                            = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (5 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.genesis.azurerm_key_vault_access_policy.developers_group_access_policy will be updated in-place
  ~ resource "azurerm_key_vault_access_policy" "developers_group_access_policy" {
        id                      = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/genesis-rg/providers/Microsoft.KeyVault/vaults/dcdcftappssboxkv/objectId/af66f4e5-bd36-4ad9-a265-d9e7c947cbab"
      ~ key_permissions         = [
          - "Decrypt",
          - "Delete",
            "Encrypt",
          - "Get",
          - "Import",
        ]
      ~ secret_permissions      = [
          - "Backup",
          - "Delete",
          - "Get",
            "List",
          - "Purge",
          - "Recover",
          - "Restore",
            "Set",
        ]
        # (5 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":378,"Program":"tfcmt","SHA1":"","Target":"sbox-genesis","Vars":{}} -->